
[
  {
    "id": "significant_chemical_hazmat_spill_001",
    "title": "Significant Chemical/HazMat Spill",
    "description": "A hazardous chemical container has ruptured in an industrial facility, releasing corrosive liquid across the floor as emergency responders in full PPE deploy absorbent barriers to contain the spread. Workers evacuate through marked routes while the incident commander activates the emergency eyewash station for an exposed employee. The critical window for containment, decontamination protocols, and coordinated evacuation determines whether this remains a localized incident or escalates into a facility-wide emergency.",
    "stats": "• Skin/eye contact causes chemical burns within seconds<br>• Toxic fumes lead to respiratory failure and organ damage<br>• Contaminated runoff spreads hazard to adjacent areas",
    "scoringDimensions": "Containment Speed, Evacuation Safety, PPE Adherence",
    "initialImageId": "initial-chemical-spill",
    "outcomeImageIds": [
      "outcome-good-1",
      "outcome-neutral-1",
      "outcome-bad-1"
    ]
  },
  {
    "id": "gas_leak_response_001",
    "title": "Gas Leak Response",
    "description": "A natural gas detector alarm triggers in a commercial building, emitting audible warnings as occupants immediately cease all spark-producing operations and open windows for ventilation. The first responder locates and shuts off the gas supply valve at the main meter while initiating building evacuation. Emergency services are called from a safe distance outside the structure to prevent ignition from electronic devices.",
    "stats": "• Single spark triggers explosion destroying entire structure<br>• Asphyxiation occurs in confined spaces within minutes<br>• Heavier-than-air gases accumulate in basements undetected",
    "scoringDimensions": "Ventilation, Source Control, Evacuation",
    "initialImageId": "initial-gas-leak",
    "outcomeImageIds": [
      "outcome-good-2",
      "outcome-neutral-2",
      "outcome-bad-2"
    ]
  },
  {
    "id": "cardiac_arrest_mall_001",
    "title": "Cardiac Arrest",
    "description": "A 55-year-old male collapses unconscious in a crowded shopping mall food court at 2:00 PM, displaying shallow breathing and a weak pulse as bystanders immediately call 911 and begin CPR. A trained responder retrieves the nearby AED, applies the pads to the patient's bare chest, and delivers a shock as directed while others manage the crowd. Continuous chest compressions continue until paramedics arrive and assume care.",
    "stats": "• Brain death begins after 4-6 minutes without oxygen<br>• Survival rate drops 7-10% every minute without CPR<br>• Permanent neurological damage likely after 10 minutes",
    "scoringDimensions": "CPR Quality, AED Application Speed, Crowd Management",
    "initialImageId": "initial-cardiac-arrest",
    "outcomeImageIds": [
      "outcome-good-3",
      "outcome-neutral-3",
      "outcome-bad-3"
    ]
  },
  {
    "id": "fire_emergency_response_001",
    "title": "Fire Emergency Response",
    "description": "Flames erupt from an electrical panel in a commercial office, rapidly spreading smoke as an employee activates the nearest pull station alarm and another grabs a Class C extinguisher to attack the fire's base using the PASS method. Smoke detectors throughout the building activate while illuminated exit signs guide occupants to evacuation routes. The fire safety warden ensures complete evacuation through designated assembly points while accounting for all personnel.",
    "stats": "• Smoke inhalation kills faster than flames—3 breaths can be fatal<br>• Flashover occurs in 3-5 minutes, reaching 1,000°F instantly<br>• Toxic gases (CO, cyanide) cause disorientation and collapse",
    "scoringDimensions": "Alarm Activation Speed, Extinguisher Use, Evacuation Path",
    "initialImageId": "initial-fire",
    "outcomeImageIds": [
      "outcome-good-2",
      "outcome-neutral-2",
      "outcome-bad-2"
    ]
  },
  {
    "id": "electrical_hazard_response_001",
    "title": "Electrical Hazard Response",
    "description": "A maintenance worker approaches a 480-volt electrical panel, first executing lockout/tagout procedures by switching off the circuit breaker, attaching a personal safety lock, and testing for zero voltage while wearing Class 0 rubber gloves and an arc-rated face shield. A nearby energized panel suddenly experiences an arc flash, producing intense light and heat as the worker immediately retreats to a safe distance. Emergency shutdown of the electrical system is initiated while the affected area is secured and assessed for damage.",
    "stats": "• 300+ deaths, 4,000+ injuries annually<br> • Arc flash temps reach 35,000°F (4x hotter than sun)<br> • 80% of deaths from bypassed safety protocols",
    "scoringDimensions": "Power Deactivation, PPE Usage, Hazard Isolation",
    "initialImageId": "initial-electrical-hazard",
    "outcomeImageIds": [
      "outcome-good-1",
      "outcome-neutral-1",
      "outcome-bad-1"
    ]
  },
  {
    "id": "flood_emergency_response_001",
    "title": "Flood Emergency",
    "description": "Flash flooding has inundated a ground-floor parking garage. Water level is at 2 feet (knee-deep) and rising. A sedan is partially submerged with unknown occupant status. Your response truck is staged at the elevated entrance ramp. Electrical systems may still be energized. You must deploy equipment in the correct sequence to ensure team safety and effective response.",
    "stats": "• Floodwater moves at lethal speed—6 inches can knock adults down, 12 inches can sweep vehicles<br>• Electrocution risk is immediate—submerged electrical systems remain energized even when power seems off<br>• Contaminated water causes rapid infection—sewage, chemicals, and debris create biohazard conditions within hours",
    "scoringDimensions": "Team Safety, Victim Assessment, Hazard Isolation",
    "initialImageId": "initial-flood",
    "outcomeImageIds": [
      "outcome-good-3",
      "outcome-neutral-3",
      "outcome-bad-3"
    ]
  }
]
